orgs/2014-11-10-ubuntu_setup.org
* 安装ubuntu系统 && git 环境安装
** android studio 开发登陆模块完成
自动生成的程序
如何发布版本 gradle
gradle 多渠道打包功能
http://www.cnblogs.com/xgjblog/p/5461245.html

** android studio 2
ide生成登陆界面
编写登录界面

http://www.server110.com/kvm/201401/4879.html
kvm not found

** apache 配置文件
http://blog.chinaunix.net/uid-21807675-id-1814871.html
** ubuntu 修改文件夹用户组
chown -P ym:ym folder

** ubuntu命令行操作
  进入fbterm模式
  进入ym用户
  敲emacs 进入编辑环境
  进入码字大模式！！
** win 10 安装sshd cygwin
咖啡厅 等公网防火墙关闭
参考 url地址  注意，no选项
http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html


** win 10 tomcat serv
   SCHEDULED: <2016-04-24 日>
http://tomcat.apache.org/tomcat-8.0-doc/windows-service-howto.html#Installing_services

http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html
C:\Program Files \(x86\)\VMware\VMware Workstation\vmrun.exe start "D:\vm-linux\suse11\SUSE Linux Enterprise 11.vmx"


/cygdrive/c/Program Files (x86)/VMware/VMware Workstation/vmrun.exe
stop  "/cygdrive/d/vm-linux/suse11/SUSE Linux Enterprise 11.vmx"

vmrun start "D:\vm-linux\suse13\SUSE Linux Enterprise 13.vmx"

vmrun start "D:\vm-linux\ubuntu-zeromq\Ubuntu 64-bit 129 zeromq-python-nodejs.vmx"

vmrun start "D:\vm-linux\ubuntu-mq\Ubuntu 64-bit 124 mq.vmx"

windows 关机命令
shutdown -s -t 3

开发个程序控制 windows 10 机器上的虚拟机
** nmap 探测主机
http://blog.chinaunix.net/uid-25885064-id-3483813.html
服务和端口
nmap -PS 192.168.1.234　
nmap -sP 192.168.1.0/24

用nmap对局域网扫描一遍，然后查看arp缓存表就可以知道局域内ip对应的mac了。
nmap比较强大也可以直接扫描mac地址和端口。执行扫描之后就可以 cat
/proc/net/arp查看arp缓存表了

ym@ym-HP430G2:~$ cat /proc/net/arp
IP address       HW type     Flags       HW address            Mask     Device
192.168.1.15     0x1         0x2         1c:e6:2b:e2:82:b1     *        wlan0
192.168.1.119    0x1         0x2         9c:21:6a:05:1d:fe     *        wlan0
192.168.1.16     0x1         0x2         00:1f:d0:28:a3:3a     *        wlan0
192.168.1.100    0x1         0x2         70:73:cb:23:ec:61     *        wlan0
192.168.1.1      0x1         0x2         00:27:19:4e:e7:76     *        wlan0
192.168.1.66     0x1         0x2         00:1f:3b:c9:68:59     *        wlan0
192.168.1.18     0x1         0x2         74:d4:35:19:a0:9c     *        wlan0
192.168.1.2      0x1         0x2         58:44:98:b8:5b:6f     *        wlan0
192.168.1.10     0x1         0x2         00:18:de:80:14:3b     *        wlan0
192.168.1.4      0x1         0x2         74:51:ba:fb:cd:1b     *        wlan0


** ubuntu 挂载硬盘

查看分区 sudo blkdi
重要命令      lsblk
sudo parted /dev/sde print
http://www.169it.com/article/3218336418.html

   buntu自动挂载硬盘方法
首先建立挂载目录
例如：
sudo mkdir /movie #根目录下建立movie文件夹
sudo mkdir /work   #根目录下建立work文件夹

然后查看硬盘信息
sudo fdisk -l

Disk /dev/sda: 500.1 GB, 500107862016 bytes
255 heads, 63 sectors/track, 60801 cylinders
Units = cylinders of 16065 * 512 = 8225280 bytes
Disk identifier: 0x6fd074d4

   Device Boot      Start         End      Blocks   Id System
/dev/sda1   *           1        3251    26113626    7 HPFS/NTFS
/dev/sda2            3252       48177   360868095    f W95 Ext'd (LBA)
/dev/sda3           48178       60801   101402280   83 Linux
/dev/sda5            3252        8414    41471766    7 HPFS/NTFS
/dev/sda6            8415       21800   107523013+   7 HPFS/NTFS
/dev/sda7           21801       47934   209921323+   7 HPFS/NTFS
/dev/sda8           47935       48177     1951866   82 Linux swap / Solaris

Disk /dev/sdb: 320.0 GB, 320072933376 bytes
255 heads, 63 sectors/track, 38913 cylinders
Units = cylinders of 16065 * 512 = 8225280 bytes
Disk identifier: 0x4fd353d4

   Device Boot      Start         End      Blocks   Id System
/dev/sdb1               1       12876   103425446    7 HPFS/NTFS
/dev/sdb2           12876       38914   209151681    7 HPFS/NTFS

这里要把sda7 sdb2自动挂载在work和movie下

修改fstab文件
sudo vim /etc/fstab

sw              0       0
/dev/scd0       /media/cdrom0   udf,iso9660 user,noauto,exec,utf8 0       0
/dev/fd0        /media/floppy0 auto    rw,user,noauto,exec,utf8 0       0
/dev/sda6       /doc            auto                             0        0
/dev/sdb1       /xp             auto                             0        0
/dev/sda7       /work           auto                             0       0
/dev/sdb2       /movie          auto                             0       0

加黑是手动加入的
保存退出重新启动就ok了

