_posts/2014-11-10-ubuntu_setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2014-11-10-ubuntu_setup</title>
<!-- 2017-02-03 五 21:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">2014-11-10-ubuntu_setup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 安装ubuntu系统 &amp;&amp; git 环境安装</a>
<ul>
<li><a href="#sec-1-1">1.1. android studio 开发登陆模块完成</a></li>
<li><a href="#sec-1-2">1.2. android studio 2</a></li>
<li><a href="#sec-1-3">1.3. apache 配置文件</a></li>
<li><a href="#sec-1-4">1.4. ubuntu 修改文件夹用户组</a></li>
<li><a href="#sec-1-5">1.5. ubuntu命令行操作</a></li>
<li><a href="#sec-1-6">1.6. win 10 安装sshd cygwin</a></li>
<li><a href="#sec-1-7">1.7. win 10 tomcat serv</a></li>
<li><a href="#sec-1-8">1.8. nmap 探测主机</a></li>
<li><a href="#sec-1-9">1.9. ubuntu 挂载硬盘</a></li>
<li><a href="#sec-1-10">1.10. ubuntu 非ｒｏｏｔ关机　不输入密码</a></li>
<li><a href="#sec-1-11">1.11. ubuntu suse zsh oh autojump &amp;&amp; fish 安装与使用；脚本灰常好用</a></li>
<li><a href="#sec-1-12">1.12. fish 设置</a></li>
<li><a href="#sec-1-13">1.13. ubuntu 修改端口和密码</a></li>
<li><a href="#sec-1-14">1.14. emacs - w3m 重新安装 太难用了</a></li>
<li><a href="#sec-1-15">1.15. grub配置 命令行模式启动</a></li>
<li><a href="#sec-1-16">1.16. fbterm 搜狗输入法安装？</a></li>
<li><a href="#sec-1-17">1.17. yong快捷键使用</a></li>
<li><a href="#sec-1-18">1.18. ubuntu 亮度调节方法</a></li>
<li><a href="#sec-1-19">1.19. 查卡主机最大亮度</a></li>
<li><a href="#sec-1-20">1.20. ubuntu 无线网络开关设置</a></li>
<li><a href="#sec-1-21">1.21. yong tty</a></li>
<li><a href="#sec-1-22">1.22. w3m显示乱码问题处理</a></li>
<li><a href="#sec-1-23">1.23. arclinux got</a></li>
<li><a href="#sec-1-24">1.24. 安装中文语言包</a></li>
<li><a href="#sec-1-25">1.25. 无线驱动无法使用 安装的两种方法：</a></li>
<li><a href="#sec-1-26">1.26. 必装软件</a></li>
<li><a href="#sec-1-27">1.27. telnet 乱码</a></li>
<li><a href="#sec-1-28">1.28. emacs 插件</a></li>
<li><a href="#sec-1-29">1.29. git环境安装</a>
<ul>
<li><a href="#sec-1-29-1">1.29.1. github 集成</a></li>
<li><a href="#sec-1-29-2">1.29.2. github 提交 rateyu@gmail.com</a></li>
<li><a href="#sec-1-29-3">1.29.3. Please tell me who you are.</a></li>
</ul>
</li>
<li><a href="#sec-1-30">1.30. ubuntu 14 访问win7</a></li>
<li><a href="#sec-1-31">1.31. ubuntu 访问win7</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 未解决的问题</a>
<ul>
<li><a href="#sec-2-1">2.1. ubuntu shell fish</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 安装ubuntu系统 &amp;&amp; git 环境安装</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> android studio 开发登陆模块完成</h3>
<div class="outline-text-3" id="text-1-1">
<p>
自动生成的程序
如何发布版本 gradle
gradle 多渠道打包功能
<a href="http://www.cnblogs.com/xgjblog/p/5461245.html">http://www.cnblogs.com/xgjblog/p/5461245.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> android studio 2</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ide生成登陆界面
编写登录界面
</p>

<p>
<a href="http://www.server110.com/kvm/201401/4879.html">http://www.server110.com/kvm/201401/4879.html</a>
kvm not found
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> apache 配置文件</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="http://blog.chinaunix.net/uid-21807675-id-1814871.html">http://blog.chinaunix.net/uid-21807675-id-1814871.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> ubuntu 修改文件夹用户组</h3>
<div class="outline-text-3" id="text-1-4">
<p>
chown -P ym:ym folder
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> ubuntu命令行操作</h3>
<div class="outline-text-3" id="text-1-5">
<p>
进入fbterm模式
进入ym用户
敲emacs 进入编辑环境
进入码字大模式！！
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> win 10 安装sshd cygwin</h3>
<div class="outline-text-3" id="text-1-6">
<p>
咖啡厅 等公网防火墙关闭
参考 url地址  注意，no选项
<a href="http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html">http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html</a>
</p>
</div>
</div>


<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> win 10 tomcat serv</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="http://tomcat.apache.org/tomcat-8.0-doc/windows-service-howto.html#Installing_services">http://tomcat.apache.org/tomcat-8.0-doc/windows-service-howto.html#Installing_services</a>
</p>

<p>
<a href="http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html">http://www.cnblogs.com/tippoint/archive/2012/10/18/2729078.html</a>
C:\Program Files \(x86\)\VMware\VMware Workstation\vmrun.exe start "D:\vm-linux\suse11\SUSE Linux Enterprise 11.vmx"
</p>


<p>
/cygdrive/c/Program Files (x86)/VMware/VMware Workstation/vmrun.exe
stop  "/cygdrive/d/vm-linux/suse11/SUSE Linux Enterprise 11.vmx"
</p>

<p>
vmrun start "D:\vm-linux\suse13\SUSE Linux Enterprise 13.vmx"
</p>

<p>
vmrun start "D:\vm-linux\ubuntu-zeromq\Ubuntu 64-bit 129 zeromq-python-nodejs.vmx"
</p>

<p>
vmrun start "D:\vm-linux\ubuntu-mq\Ubuntu 64-bit 124 mq.vmx"
</p>

<p>
windows 关机命令
shutdown -s -t 3
</p>

<p>
开发个程序控制 windows 10 机器上的虚拟机
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> nmap 探测主机</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<a href="http://blog.chinaunix.net/uid-25885064-id-3483813.html">http://blog.chinaunix.net/uid-25885064-id-3483813.html</a>
服务和端口
nmap -PS 192.168.1.234　
nmap -sP 192.168.1.0/24
</p>

<p>
用nmap对局域网扫描一遍，然后查看arp缓存表就可以知道局域内ip对应的mac了。
nmap比较强大也可以直接扫描mac地址和端口。执行扫描之后就可以 cat
/proc/net/arp查看arp缓存表了
</p>

<p>
ym@ym-HP430G2:~$ cat /proc/net/arp
IP address       HW type     Flags       HW address            Mask     Device
192.168.1.15     0x1         0x2         1c:e6:2b:e2:82:b1     *        wlan0
192.168.1.119    0x1         0x2         9c:21:6a:05:1d:fe     *        wlan0
192.168.1.16     0x1         0x2         00:1f:d0:28:a3:3a     *        wlan0
192.168.1.100    0x1         0x2         70:73:cb:23:ec:61     *        wlan0
192.168.1.1      0x1         0x2         00:27:19:4e:e7:76     *        wlan0
192.168.1.66     0x1         0x2         00:1f:3b:c9:68:59     *        wlan0
192.168.1.18     0x1         0x2         74:d4:35:19:a0:9c     *        wlan0
192.168.1.2      0x1         0x2         58:44:98:b8:5b:6f     *        wlan0
192.168.1.10     0x1         0x2         00:18:de:80:14:3b     *        wlan0
192.168.1.4      0x1         0x2         74:51:ba:fb:cd:1b     *        wlan0
</p>
</div>
</div>


<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> ubuntu 挂载硬盘</h3>
<div class="outline-text-3" id="text-1-9">
<p>
查看分区 sudo blkdi
重要命令      lsblk
sudo parted /dev/sde print
<a href="http://www.169it.com/article/3218336418.html">http://www.169it.com/article/3218336418.html</a>
</p>

<p>
   buntu自动挂载硬盘方法
首先建立挂载目录
例如：
sudo mkdir /movie #根目录下建立movie文件夹
sudo mkdir /work   #根目录下建立work文件夹
</p>

<p>
然后查看硬盘信息
sudo fdisk -l
</p>

<p>
Disk /dev/sda: 500.1 GB, 500107862016 bytes
255 heads, 63 sectors/track, 60801 cylinders
Units = cylinders of 16065 * 512 = 8225280 bytes
Disk identifier: 0x6fd074d4
</p>

<p>
   Device Boot      Start         End      Blocks   Id System
/dev/sda1   *           1        3251    26113626    7 HPFS/NTFS
/dev/sda2            3252       48177   360868095    f W95 Ext'd (LBA)
/dev/sda3           48178       60801   101402280   83 Linux
/dev/sda5            3252        8414    41471766    7 HPFS/NTFS
/dev/sda6            8415       21800   107523013+   7 HPFS/NTFS
/dev/sda7           21801       47934   209921323+   7 HPFS/NTFS
/dev/sda8           47935       48177     1951866   82 Linux swap / Solaris
</p>

<p>
Disk /dev/sdb: 320.0 GB, 320072933376 bytes
255 heads, 63 sectors/track, 38913 cylinders
Units = cylinders of 16065 * 512 = 8225280 bytes
Disk identifier: 0x4fd353d4
</p>

<p>
   Device Boot      Start         End      Blocks   Id System
/dev/sdb1               1       12876   103425446    7 HPFS/NTFS
/dev/sdb2           12876       38914   209151681    7 HPFS/NTFS
</p>

<p>
这里要把sda7 sdb2自动挂载在work和movie下
</p>

<p>
修改fstab文件
sudo vim /etc/fstab
</p>

<p>
sw              0       0
/dev/scd0       /media/cdrom0   udf,iso9660 user,noauto,exec,utf8 0       0
/dev/fd0        /media/floppy0 auto    rw,user,noauto,exec,utf8 0       0
/dev/sda6       /doc            auto                             0        0
/dev/sdb1       /xp             auto                             0        0
/dev/sda7       /work           auto                             0       0
/dev/sdb2       /movie          auto                             0       0
</p>

<p>
加黑是手动加入的
保存退出重新启动就ok了
</p>
</div>
</div>
