_posts/2014-11-10-ubuntu_setup.html

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> ubuntu 非ｒｏｏｔ关机　不输入密码</h3>
<div class="outline-text-3" id="text-1-10">
<p>
进入终端，执行sudo visudo
</p>

<p>
在#User privilege specification下面会罗列一些规则，我们现在需要做的是对我们的用户进行一些操作。假如我们的用户名为nenew
</p>

<p>
在文件的最后一行添加：
</p>


<p>
在#User privilege specification下面会罗列一些规则，我们现在需要做的是对我们的用户进行一些操作。假如我们的用户名为nenew
</p>

<p>
在文件的最后一行添加：
</p>

<p>
nenew    ALL=(ALL) NOPASSWD: ALL
</p>

<p>
然后保存退出，执行
</p>

<p>
sudo usermod -aG admin nenew
</p>

<p>
重启下看看nenew帐号执行sudo还需要密码么？这里我们需要了解顺序这个问题，在ubuntu的wiki上有比较详细的介绍。
</p>

<p>
%admin ALL=(ALL) ALL
这行只是让admin组的用户拥有可以像任何帐号一样执行命令的能力，但是还是需要有密码的，因此我们需要把我们的nenew用户加入到admin组中，所以有sudo usermod
-aG admin nenew ，然后是对其进行NOPASSWD定义，这行一定要在%admin ALL=(ALL) ALL 这行后面，才会生效。
</p>

<p>
文章发玩之后很多朋友提出不安全问题来，确实，这样是存在安全隐患的。奶牛此文的目的也只是想让各位了解下sudoers的那个生效的顺序，当然，我们可以把最后的
</p>

<p>
nenew    ALL=(ALL) NOPASSWD: ALL 更改为对于命令进行限制，例如对于关机命令取消密码
</p>

<p>
nenew    ALL=(ALL) NOPASSWS: /sbin/shutdown, /sbin/halt, /sbin/reboot
</p>

<p>
更详细的说明请看:
</p>

<p>
<a href="https://help.ubuntu.com/community/Sudoers">https://help.ubuntu.com/community/Sudoers</a>
</p>

<p>
<a href="http://www.gratisoft.us/sudo/sudoers.man.html">http://www.gratisoft.us/sudo/sudoers.man.html</a>
</p>

<p>
注意：如果你添加了一行在root的下面，这样的话修改是不会生效的，因为%admin ALL=(ALL) ALL这行的策略会覆盖掉nenew的这条策略，又变成需要密码，所以你可以
把nenew这句话搬到admin这句话的后面，立马生效。
</p>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> ubuntu suse zsh oh autojump &amp;&amp; fish 安装与使用；脚本灰常好用</h3>
<div class="outline-text-3" id="text-1-11">
<p>
autojump &lt;&#x2013;&gt; fish popd pushd dirs 
</p>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> fish 设置</h3>
<div class="outline-text-3" id="text-1-12">
<p>
当然如果你实在想配置，输入 fish<sub>config</sub> 命令会启动 web 管理界面。
</p>

<p>
什么？逼格太低，非要手动配置。OK， ~/.config/fish/config.fish这就是 fish 的配置文件，类似于 bash 的.bashrc。
</p>

<p>
我喜欢配置三件东西：
</p>

<p>
1.问候语（配置config.fish）：
</p>


<p>
复制代码
代码如下:
set fish<sub>greeting</sub> 'Talk is cheap. Show me the code.'
</p>

<p>
2.命令行提示（在web界面配置，完成后会生成~/.config/fish/functions/fish<sub>prompt</sub>.fish）：
</p>

<p>
<a href="http://www.jb51.net/LINUXjishu/408682.html">http://www.jb51.net/LINUXjishu/408682.html</a>
</p>
</div>
</div>


<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> ubuntu 修改端口和密码</h3>
<div class="outline-text-3" id="text-1-13">
<p>
/etc/ssh/sshd<sub>config</sub>
</p>
<ol class="org-ol">
<li>修改 root 密码
</li>
</ol>
<p>
sudo passwd root
[root@localhost /]#service ssh restart
</p>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> emacs - w3m 重新安装 太难用了</h3>
<div class="outline-text-3" id="text-1-14">
<p>
每次都对 c<sub>c</sub> c<sub>k</sub>
重新再装一遍
</p>
</div>
</div>
<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> grub配置 命令行模式启动</h3>
<div class="outline-text-3" id="text-1-15">
<p>
emacs /etc/default/grub
千万注意 需要更新  update-grub2
否则无效
</p>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> fbterm 搜狗输入法安装？</h3>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> yong快捷键使用</h3>
<div class="outline-text-3" id="text-1-17">
<p>
一键切换到 输入法  ctrl<sub>`</sub>
注意删除 不使用的输入法会更快
<i>root</i>.yong/yong.ini 这个是缓存文件 修改/usr/local/yong/路径下的文件不
起作用的
</p>
</div>
</div>

<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> ubuntu 亮度调节方法</h3>
<div class="outline-text-3" id="text-1-18">
<p>
Ubuntu / Debian 系统有一个通病，那就是每次开机，系统都会把你的屏幕亮度调到最大值。 我很惊讶为什么到了14.04版本这个问题还是没有修复。 不过我们可以通过脚本让Ubuntu每次启动时都把亮度设置成一个固定的值。
</p>

<p>
首先查看一下你的屏幕亮度值的范围：
</p>

<p>
sudo cat /sys/class/backlight/acpi<sub>video0</sub>/max<sub>brightness</sub>
</p>

<p>
我的是15，也就是说亮度值可以在 0 ~ 15之间。
</p>

<p>
修改 /etc/rc.local ,在最后的 exit 0 之前添加：
</p>

<p>
echo 3 &gt; /sys/class/backlight/acpi<sub>video0</sub>/brightness
</p>

<p>
系统完成启动最后会执行这个脚本，因此每次开机，都会把亮度值设置成3
</p>
</div>
</div>


<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> 查卡主机最大亮度</h3>
<div class="outline-text-3" id="text-1-19">
<p>
1 查看自己的系统亮度的最大值：
</p>

<p>
cd /sys/class/backlight
</p>

<p>
[Center]
</p>

<p>
（笔记本的显卡型号不同-&gt;亮度调节文件夹名会不同）。
</p>

<p>
2 我的是intel<sub>backlight</sub>
</p>

<p>
cd intel<sub>backlight</sub>
</p>

<p>
[Center]
</p>

<p>
3 来到这里，你肯定知道：max<sub>brightness</sub> 系统可以调节的最大亮度值。
bightness就是你正使用的亮度值了。
</p>

<p>
cat max<sub>brightness</sub>
</p>

<p>
cat brightness
</p>
</div>
</div>


<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> ubuntu 无线网络开关设置</h3>
<div class="outline-text-3" id="text-1-20">
<p>
ifconfig wlan0 down
ifconfig wlan0 up   
</p>
</div>
</div>

<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> yong tty</h3>
<div class="outline-text-3" id="text-1-21">
<p>
<b>* yong拼音输入法搞定了，尝试了下还可以，这下可以强制不上网页了，专注文字
*</b> 之前没有安装成功，理由是安装在32位，安装64位就可以了
</p>

<p>
三：下载并安装小小拼音输入法(yong),由于该软件在Linux下只提供7z压缩
包文件,所以需下载并安装p7zip工具包.
(1). 安装p7zip:
下载地址:
<a href="http://sourceforge.net/projects/p7zip/files/p7zip/9.20.1/p7zip_9.20.1_src_all.tar.bz2/download">http://sourceforge.net/projects/p7zip/files/p7zip/9.20.1/p7zip_9.20.1_src_all.tar.bz2/download</a>
</p>

<p>
make 7z
sudo ./install.sh
</p>

<p>
(2). 下载并解压yong:
下载地址:<a href="http://u.115.com/file/bh1ojcho">http://u.115.com/file/bh1ojcho</a>
</p>

<p>
解压：
7z x yong-lin-1.7.0-1.7z
</p>

<p>
(3). 安装：
sudo mv yong /usr/local
cd /usr/local/yong
sudo ./yong-tool.sh &#x2013;install
</p>

<p>
(4). 修改配置文件"~/.yong/yong.ini",修改默认输入法为pinyin:
</p>

<p>
[IM]
default=6
中英文切换键改为左SHIFT:
[key]
CNen=LSHIFT
</p>

<p>
四：接着,修改fbterm的配置文件"~/.fbtermrc",使fbterm使用yong作为
其默认的输入法:
</p>



<p>
input-method=yong
免费下载地址在 <a href="http://linux.linuxidc.com/">http://linux.linuxidc.com/</a>             升启动                                
</p>
<ul class="org-ul">
<li>Apache Tomcat 8.0.32 发布下载         
</li>
</ul>
<p>
用户名与密码都是www.linuxidc.com                    * Gitlab 8.4.4 发布下载，Git 代码托管平 
                                                      台                                    
具体下载目录在 <i>pub/小小输入法(yong输入法)</i>                                                 
</p>

<p>
使用方法：                                                                                  
</p>

<p>
安装：                                                                                      
进安装目录，执行命令                                                                        
sudo ./yong-tool.sh –install                                                                
</p>

<p>
卸载：                                                                                      
sudo ./yong-tool.sh –uninstall                    本周热门                                  
</p>

<p>
选择作为默认输入法：                                                                        
./yong-tool.sh –select                                                                      
</p>
<ul class="org-ul">
<li>Linux公社下载FTP资源的请到FTP服务中心 
</li>
</ul>
<p>
具体事项你可以参考压缩包里面的yong.chm，当然你先      激活会                                
要安装一个chm阅读器如chmsee                         * 免费才最贵：揭露「免费」Windows 10 的 
sudo apt-get install chmsee                           真实成                                
</p>
</div>
</div>


<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> w3m显示乱码问题处理</h3>
<div class="outline-text-3" id="text-1-22">
<p>
安装完字符集后，访问百度网址正常
<a href="http://www.linuxidc.com/Linux/2014-02/96939.htm">http://www.linuxidc.com/Linux/2014-02/96939.htm</a>
</p>

<p>
中文输入
<a href="http://blog.csdn.net/flywindmouse/article/details/13527769">http://blog.csdn.net/flywindmouse/article/details/13527769</a>
</p>

<p>
<a href="http://www.guokr.com/blog/749084/">http://www.guokr.com/blog/749084/</a>
<a href="http://rutine.blog.163.com/blog/static/7908087220144155448206/">http://rutine.blog.163.com/blog/static/7908087220144155448206/</a>
<a href="http://www.linuxidc.com/Linux/2015-01/111975.htm">http://www.linuxidc.com/Linux/2015-01/111975.htm</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> arclinux got</h3>
<div class="outline-text-3" id="text-1-23">
<p>
<a href="http://jingyan.baidu.com/article/59a015e3a9170ef7948865f3.html">http://jingyan.baidu.com/article/59a015e3a9170ef7948865f3.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="section-number-3">1.24</span> 安装中文语言包</h3>
<div class="outline-text-3" id="text-1-24">
<ul class="org-ul">
<li>sudo apt-get install language-pack-zh-hans
</li>
<li>Ubuntu默认的中文字符编码
</li>
</ul>
<p>
Ubuntu默认的中文字符编码为zh<sub>CN</sub>.UTF-8，这个可以在
/etc/environment中看到：
sudo gedit /etc/environment
可以看到如下内容：
PATH="/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games"
LANG="zh<sub>CN</sub>.UTF-8"
LANGUAGE="zh<sub>CN</sub>:zh:en<sub>US</sub>:en"
</p>
</div>
</div>


<div id="outline-container-sec-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="section-number-3">1.25</span> 无线驱动无法使用 安装的两种方法：</h3>
<div class="outline-text-3" id="text-1-25">
<ol class="org-ol">
<li>连接网络 直到重启安装无线驱动结束
</li>
<li>安装mint驱动程序
</li>
</ol>
<p>
Mint Driver Manager 
<a href="http://www.linuxidc.com/Linux/2014-05/102128.htm">http://www.linuxidc.com/Linux/2014-05/102128.htm</a>
</p>

<p>
注意：搜索中文名，驱动管理才能找到！
</p>
</div>
</div>

<div id="outline-container-sec-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="section-number-3">1.26</span> 必装软件</h3>
<div class="outline-text-3" id="text-1-26">
<p>
emacs 强大的不用我讲了
emacs +w3m  网页也可以文本编辑
chromium 浏览器非常好用
</p>
</div>
</div>
