_posts/2014-11-10-ubuntu_setup.html

<div id="outline-container-sec-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="section-number-3">1.27</span> telnet 乱码</h3>
<div class="outline-text-3" id="text-1-27">
<p>
local 是 utf-8 的时候 telnet gbk编码的bbs 会出现乱码
</p>

<p>
设置终端字符集为 gbk
</p>

<p>
解决方法 : 使用 luit
luit -encoding gbk telnet bbs.tsinghua.edu.cn 
</p>
</div>
</div>
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="section-number-3">1.28</span> emacs 插件</h3>
<div class="outline-text-3" id="text-1-28">
<p>
yasnippets：  snippets c++ java
jdee：       自动导入jar包  集成编译和运行 调试
这个装起来比较笨重 不好用
emacs 字体： 家里的输入法字体换爽 公司的字体很差，可以考虑下如何修改
</p>
</div>
</div>

<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="section-number-3">1.29</span> git环境安装</h3>
<div class="outline-text-3" id="text-1-29">
</div><div id="outline-container-sec-1-29-1" class="outline-4">
<h4 id="sec-1-29-1"><span class="section-number-4">1.29.1</span> github 集成</h4>
</div>
<div id="outline-container-sec-1-29-2" class="outline-4">
<h4 id="sec-1-29-2"><span class="section-number-4">1.29.2</span> github 提交 rateyu@gmail.com</h4>
<div class="outline-text-4" id="text-1-29-2">
<p>
github
</p>

<ol class="org-ol">
<li>在本地建立一个文件夹，然后做一些全局变量的初始化
</li>
</ol>
<p>
git config &#x2013;global user.name = "用户名或者用户ID"
git config &#x2013;global user.email = "邮箱"
这两个选项会在以后的使用过程中自动添加到代码中。
</p>

<ol class="org-ol">
<li>创建验证用的公钥
</li>
</ol>
<p>
这个是比较复杂和困扰大多数人的地方，因为 git 是通过 ssh 的方式访问资源库的，所以需要在本地创建验证用的文件。
使用命令：ssh-keygen -C 'you email address@gmail.com' -t rsa
会在用户目录 ~/.ssh/ 下建立相应的密钥文件
可以使用 ssh -v git@github.com 命令来测试链接是否畅通
</p>
<ol class="org-ol">
<li>上传公钥
</li>
</ol>
<p>
在 github.com 的界面中 选择右上角的 Account Settings，然后选择 SSH Public Keys ，选择新加。
Title 可以随便命名，Key 的内容拷贝自 ~/.ssh/id<sub>rsa</sub>.pub 中的内容，完成后，可以再使用 ssh -v git@github.com 进行测试。看到下面的信息表示验证成功。
</p>

<ul class="org-ul">
<li>注意：此处要重启os，比较奇怪
</li>
<li>emacs -nw  不使用x11界面
</li>

<li>复制代码
</li>
</ul>

<p>
使用 git clone git@github.com:cocowool/userguide.git userguide 可以将代码复制到本地的 userguide 文件夹中
</p>


<p>
git config &#x2013;global user.email=rateyu@gmail.com
ssh-keygen -C 'rateyu@gmail.com' -t rsa
cat .ssh/id<sub>rsa</sub>.pub
</p>

<p>
git clone git@github.com:rateyu/rateyu.github.io.git ./blog2015
此种方式有读写权限
</p>

<p>
&gt; 运行命令$git clone <a href="https://github.com/jenkinsci/gerrit-trigger-plugin.git">https://github.com/jenkinsci/gerrit-trigger-plugin.git</a>
&gt; 此种方式只有读的权限
</p>

<p>
sublime txt 3 github使用说明
安装 包管理器
git quick commit
git push current branch
</p>


<ol class="org-ol">
<li>提交流程
</li>
<li>git add .
</li>
<li>git commit -m "ubuntu 14 环境安装"
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-29-3" class="outline-4">
<h4 id="sec-1-29-3"><span class="section-number-4">1.29.3</span> Please tell me who you are.</h4>
<div class="outline-text-4" id="text-1-29-3">
<p>
Run
  git config &#x2013;global user.email "you@example.com"
  git config &#x2013;global user.name "Your Name"
</p>

<ol class="org-ol">
<li>提交远程代码
</li>
</ol>
<p>
git push -u origin master
</p>

<p>
其他相关命令参考：
</p>

<p>
进行自己的修改，完成后请求原作者合并
git pull person master 
</p>

<p>
git init
</p>
<p>
git add &lt;modified files&gt;
</p>
<p>
git add .
</p>
<p>
git commit -m "msg"
</p>
<p>
git commit -a -m "msg"
</p>
<p>
git push
</p>
<p>
git pull
</p>
<p>
git pull git://github.com/tom/test.git
</p>

<p>
git branch bug<sub>fix</sub> # 建立branch，名为bug<sub>fix</sub>
git checkout bug<sub>fix</sub> # 切换到bug<sub>fix</sub>
git checkout master #切换到主要的repo
git merge bug<sub>fix</sub> #把bug<sub>fix这个branch和现在的branch合并</sub>
</p>

<p>
git branch -r # 查看远程branch
git checkout -b bug<sub>fix</sub><sub>local</sub> bug<sub>fix</sub><sub>remote</sub> #把本地端切换为远程的bug<sub>fix</sub><sub>remote</sub> branch并命名为bug<sub>fix</sub><sub>local</sub>
</p>

<p>
git log #可以查看每次commit的改变
git diff #可以查看最近一次改变的內容，加上参数可以看其它的改变并互相比较
git show #可以看某次的变更
</p>

<p>
git status
</p>


<p>
参考url地址：
<a href="http://www.cnblogs.com/cocowool/archive/2010/10/19/1855616.html">http://www.cnblogs.com/cocowool/archive/2010/10/19/1855616.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="section-number-3">1.30</span> ubuntu 14 访问win7</h3>
<div class="outline-text-3" id="text-1-30">
<p>
Ubuntu14.04 远程连接Win7 报错：无法连接到RDP服务器
</p>

<p>
ym@ym-HP430G2:~$ cd .freerdp/
ym@ym-HP430G2:~/.freerdp$ ls
certs  known<sub>hosts</sub>
ym@ym-HP430G2:~/.freerdp$ rm -rf known<sub>hosts</sub> 
ym@ym-HP430G2:~/.freerdp$ ls
certs
ym@ym-HP430G2:~/.freerdp$ swkey 
ym@ym-HP430G2:~/.freerdp$ 
</p>
</div>
</div>

<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="section-number-3">1.31</span> ubuntu 访问win7</h3>
<div class="outline-text-3" id="text-1-31">
<p>
rdp 方式访问
用户名密码
还有域名
<a href="http://www.th7.cn/system/lin/201410/72661.shtml">http://www.th7.cn/system/lin/201410/72661.shtml</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 未解决的问题</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> ubuntu shell fish</h3>
<div class="outline-text-3" id="text-2-1">
<p>
整理几个好用的 Ubuntu 工具(Sublime Text, Jupiter, Tweak, MyUnity,
Guake, Fish, dnsmasq)
Ubuntu完全教程，让你成为Ubuntu高手！
<a href="http://www.cnblogs.com/dutlei/archive/2012/11/20/2778327.html">http://www.cnblogs.com/dutlei/archive/2012/11/20/2778327.html</a>
</p>

<p>
sudo apt-get install fish
</p>

<p>
从bash进入fish直接输入fish就行了
安装好第一步是修改 OS 默认 shell：
</p>

<p>
复制代码代码如下:
</p>

<p>
chsh -s /usr/bin/fish
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-02-03 五 21:54</p>
</div>
</body>
</html>
